{ "_id" : { "$oid" : "5909959897d7df021c893108" }, "updatedAt" : { "$date" : "2017-05-03T10:32:25.027+0200" }, "createdAt" : { "$date" : "2017-05-03T10:32:25.027+0200" }, "title" : "Exercice 1", "content" : "i)\nID :                         Zhirayr82@hotmail.\nMot de passe :    qa\n\nii)\n1.qund on fait fork on fait copy de repository sur notre github\n2.aprés le git clone on poura travaillé sur le project, mais on poura pas fair commit ou créer une autre branch\n3.Aprés le travaille si on veut garder les modifications on fait pull requeste pour en demendent l'admin qui il enresitre les modification\n4.Avec les branchs on travaill étape par étape, marche en marche, et si on veut on poura rebrendre la branche et modifier\n5.Qund on fork on copy le la branch de admin, pour que on travaill et notravaill vas resté, il faudra on cree notre branch et travaille sur notre branche, et après quand on feura pull requeste l'admin feura merge notre branch", "__v" : 0 }
{ "_id" : { "$oid" : "5909a0c997d7df021c893109" }, "updatedAt" : { "$date" : "2017-05-03T11:20:09.934+0200" }, "createdAt" : { "$date" : "2017-05-03T11:20:09.934+0200" }, "title" : "La MEAN stack", "content" : "Angular - notre code seura ecrit en framework AngurarJS,   \nAngular UI Router - pour fair les roots pour notre angular, ngRoute, $stateProvider, ui-sref etc   \nExpress - pour paramétre nodeJS, avec Express().use ou app.use,        \nJSONWebToken - pour chaque utilisateur on gener jsw pour angular, mais seura pas enregistré dans le mongo\nMongoose - c'est pour notre base de donné, ou on va annonce les collection avec ces cles \nMaterializeCSS - c'est une  Framework CSS, comme bootsrap\nPassport - on utilise passport pour authentification \nBabel - on utilise babel pour notre server va connaitre les nouveau, place de require on poura utilise import - from,      \nSCSS - est un langage, ce que on poura ecrire dans le css,          \nNodemon - quend on install nodemon il charge automatiqement nos modification coté d'angular dans navigateur \nWebpack - est une module, qui prend tout notre code est il génere dans le fichier bunde js, on poura parametré avec webpack.config.js les dépondance et ajouté les plugins      \nLivereload - il est un plugin qui charge automatiqement nos modification coté d'angular dans navigateur\n\n\na. MEAN Stack - c'est le systeme de travaille sur le project, il est bien construi et il facille a structuré notre code\nb. on va utilisé front & back   \nc. MEAN MongoDB, ExpressJS, AngularJS, NodeJS", "__v" : 0 }
